
## Plan Result

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21108490986)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * helm_release.argocd
  * kubernetes_secret_v1.argocd_repo_access
* Update
  * module.talos.hcloud_server.control_planes[&#34;control-plane-1&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "9.3.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_secret_v1.argocd_repo_access will be created
  + resource "kubernetes_secret_v1" "argocd_repo_access" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "repo-creds"
            }
          + name             = "argo-private-repo-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.talos.hcloud_server.control_planes["control-plane-1"] will be updated in-place
  ~ resource "hcloud_server" "control_planes" {
        id                         = "117738718"
        name                       = "control-plane-1"
        # (20 unchanged attributes hidden)

      - network {
          - alias_ips   = [
              - "10.0.1.100",
            ] -> null
          - ip          = "10.0.1.101" -> null
          - mac_address = "86:00:00:82:6d:43" -> null
          - network_id  = 11848573 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.1.101"
          + mac_address = (known after apply)
          + network_id  = 11848573
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"infra-plan","PRNumber":8,"Program":"tfcmt","SHA1":"b6c05c87bbf0be8060eaaa6b50ee2139080a9a9a","Vars":{},"WorkflowName":"infra-plan"} -->